# ProjectLocationSet Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
ProjectLocationSet Class
Members See Also
---
An set that contains project locations.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class ProjectLocationSet : APIObject,
	IEnumerable
```

Visual Basic
---
```text
Public Class ProjectLocationSet _
	Inherits APIObject _
	Implements IEnumerable
```

Visual C++
---
```text
public ref class ProjectLocationSet : public APIObject,
	IEnumerable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..APIObject Autodesk.Revit.DB..::..ProjectLocationSet
# See Also
ProjectLocationSet Members
Autodesk.Revit.DB Namespace